# conftest.py
import pytest

@pytest.fixture
def sample_transactions():
    return [
        {
            "Дата операции": "2024-02-15",
            "Категория": "Еда",
            "Сумма списания": 1000
        },
        {
            "Дата операции": "2024-02-20",
            "Категория": "Транспорт",
            "Сумма списания": 500
        },
        {
            "Дата операции": "2024-02-25",
            "Категория": "Еда",
            "Сумма списания": 200
        },
        {
            "Дата операции": "2024-01-10",  # тоже попадает
            "Категория": "Развлечения",
            "Сумма списания": 300
        },
        {
            "Дата операции": "2024-02-18",
            "Категория": "Еда",
            "Сумма списания": -50
        }
    ]


@pytest.fixture
def simple_transactions():
    return [
        {"Дата операции": "2023-07-05", "Сумма операции": 120.0},
        {"Дата операции": "2023-07-15", "Сумма операции": 80.0},
        {"Дата операции": "2023-06-20", "Сумма операции": 200.0}
    ]